Revit 2024 API
Rebar.GetFullGeometryForView Method
 Generates full geometry for the Rebar for a specific view.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public GeometryElement GetFullGeometryForView(
	View view
)
Visual Basic
Public Function GetFullGeometryForView ( _
	view As View _
) As GeometryElement
Visual C++
public:
GeometryElement^ GetFullGeometryForView(
	View^ view
)
Parameters
view
Type: Autodesk.Revit.DB.View
 The view in which the geometry is generated.
Return Value
 The generated geometry of the Rebar before cutting is applied.
Remarks
 The result of this method differs from Element.Geometry in that Element.Geometry will return the rebar geometry cut by the view extents (such as the section box). In this method the entire Rebar geometry is returned for the given view, before cutting.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace